class ХудожнійТвір:
    def __init__(self, назва, автор):
        self.назва = назва
        self.автор = автор

class Техніка:
    def __init__(self, матеріал, стиль):
        self.матеріал = матеріал
        self.стиль = стиль

class Картина(ХудожнійТвір, Техніка):
    def __init__(self, назва, автор, матеріал, стиль, ширина, висота, вартість):
        ХудожнійТвір.__init__(self, назва, автор)
        Техніка.__init__(self, матеріал, стиль)
        self.ширина = ширина
        self.висота = висота
        self.вартість = вартість

    def вивести_інформацію(self):
        print("Інформація про картину:")
        print(f"Назва: {self.назва}")
        print(f"Автор: {self.автор}")
        print(f"Матеріал: {self.матеріал}")
        print(f"Стиль: {self.стиль}")
        print(f"Ширина: {self.ширина} см")
        print(f"Висота: {self.висота} см")
        print(f"Вартість: {self.вартість} грн")

    def змінити_вартість(self, нова_вартість):
        self.вартість = нова_вартість

    def прочитати_вартість(self):
        return self.вартість

if __name__ == "__main__":
    моя_картина = Картина("", "", "", "", 60, 80, 10000)

    моя_картина.вивести_інформацію()
    нова_вартість = 12000
    моя_картина.змінити_вартість(нова_вартість)
    print(f"Нова вартість картини: {моя_картина.прочитати_вартість()} грн")